### Задание 2
По данным файла power.csv посчитайте суммарное потребление стран Прибалтики (Латвия, Литва и Эстония) категорий 4, 12 и 21 за период с 2005 по 2010 года. Не учитывайте в расчетах отрицательные значения quantity.

In [1]:
import pandas as pd

In [2]:
data = pd.read_csv('power.csv')
data.head(5)

   country  year  quantity  category
0  Austria  1996       5.0         1
1  Austria  1995      17.0         1
2  Belgium  2014       0.0         1
3  Belgium  2013       0.0         1
4  Belgium  2012      35.0         1

In [3]:
#filtered_countries = data[ (data['country']=='es') | (data['country']=='es') ]
data[ data['country'].str.contains('li', case=False) ]['country'].unique()
#filtered_countries

array(['Korea, Republic of', 'Lithuania', 'Australia', 'Philippines',
       'Republic of Moldova', 'Belize', 'Bolivia (Plur. State of)',
       'Dominican Republic', 'Liberia', 'Libya',
       'Venezuela (Bolivar. Rep.)', 'Mali', 'Syrian Arab Republic',
       'Somalia', 'Mongolia', 'Liechtenstein', 'Wallis and Futuna Is.'],
      dtype=object)

In [5]:
filtered_countries = data[ ((data['country']=='Estonia') | (data['country']=='Latvia') | (data['country']=='Lithuania')) 
                          & 
                          ((data['category']==4) | (data['category']==11) | (data['category']==21))
                         ]
#filtered_countries_category = filtered_countries[(filtered_countries['category']==4) | (filtered_countries['category']==11) | (filtered_countries['category']==21)]
filtered_countries.head()

       country  year  quantity  category
10617  Estonia  2008       1.0         4
10618  Estonia  2007       0.0         4
10619  Estonia  2006       0.0         4
10620  Estonia  2005       1.0         4
10621  Estonia  2004       1.0         4

In [6]:
year_2005_2010 = filtered_countries.query('2004 < year < 2011') #and ('quantity > 0'))
#if year_2005_2010['quantity'] > 0:

#filtered_countries['country'].unique()
#country_stats.query('quantity > {}'.format(average_level)).head()
year_2005_2010

          country  year  quantity  category
10617     Estonia  2008       1.0         4
10618     Estonia  2007       0.0         4
10619     Estonia  2006       0.0         4
10620     Estonia  2005       1.0         4
11156   Lithuania  2008       1.0         4
...           ...   ...       ...       ...
253982  Lithuania  2009      98.0        21
253983  Lithuania  2008      54.0        21
253984  Lithuania  2007      47.0        21
253985  Lithuania  2006      31.0        21
253986  Lithuania  2005       1.0        21

[317 rows x 4 columns]

In [7]:
print(year_2005_2010['quantity'].sum())

234254.0

In [8]:
itog_quantity_country = year_2005_2010[ (year_2005_2010['quantity'] > 0)]
itog_quantity_country.groupby(['country','year'])['quantity'].sum()

country    year
Estonia    2005    10252.0
           2006    10234.0
           2007    10508.0
           2008    10782.0
           2009    10660.0
           2010    11004.0
Latvia     2005     8664.0
           2006     8604.0
           2007     8532.0
           2008     8620.0
           2009    10104.0
           2010    10320.0
Lithuania  2005    18230.0
           2006    19874.0
           2007    19972.0
           2008    20146.0
           2009    21156.0
           2010    16592.0
Name: quantity, dtype: float64

In [9]:
print(itog_quantity_country['quantity'].sum())

234254.0